experiments/workflow/boki-hotel/expected_results/qps100/wrk.log
Running 2m test @ http://ip-172-31-7-164.us-east-2.compute.internal:8080
  2 threads and 2 connections
  Thread calibration: mean lat.: 6.299ms, rate sampling interval: 43ms
  Thread calibration: mean lat.: 6.507ms, rate sampling interval: 50ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.45ms   13.41ms  45.18ms   79.89%
    Req/Sec    50.27     23.76   119.00     66.95%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.08ms
 75.000%    1.63ms
 90.000%   40.96ms
 99.000%   44.99ms
 99.900%   45.02ms
 99.990%   45.02ms
 99.999%   45.22ms
100.000%   45.22ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.275     0.000000            1         1.00
       0.542     0.100000         1404         1.11
       0.685     0.200000         2803         1.25
       0.844     0.300000         4202         1.43
       0.960     0.400000         5604         1.67
       1.079     0.500000         7008         2.00
       1.136     0.550000         7708         2.22
       1.198     0.600000         8416         2.50
       1.265     0.650000         9101         2.86
       1.365     0.700000         9801         3.33
       1.634     0.750000        10500         4.00
       5.319     0.775000        10864         4.44
      21.151     0.800000        11250         5.00
      21.407     0.825000        11603         5.71
      21.487     0.850000        11922         6.67
      25.183     0.875000        12372         8.00
      25.199     0.887500        12512         8.89
      40.959     0.900000        12683        10.00
      41.055     0.912500        12827        11.43
      41.215     0.925000        13046        13.33
      41.247     0.937500        13226        16.00
      41.247     0.943750        13226        17.78
      41.279     0.950000        13484        20.00
      41.279     0.956250        13484        22.86
      41.279     0.962500        13484        26.67
      44.991     0.968750        13955        32.00
      44.991     0.971875        13955        35.56
      44.991     0.975000        13955        40.00
      44.991     0.978125        13955        45.71
      44.991     0.981250        13955        53.33
      44.991     0.984375        13955        64.00
      44.991     0.985938        13955        71.11
      44.991     0.987500        13955        80.00
      44.991     0.989062        13955        91.43
      44.991     0.990625        13955       106.67
      44.991     0.992188        13955       128.00
      44.991     0.992969        13955       142.22
      44.991     0.993750        13955       160.00
      44.991     0.994531        13955       182.86
      44.991     0.995313        13955       213.33
      44.991     0.996094        13955       256.00
      44.991     0.996484        13955       284.44
      45.023     0.996875        13999       320.00
      45.023     0.997266        13999       365.71
      45.023     0.997656        13999       426.67
      45.023     0.998047        13999       512.00
      45.023     0.998242        13999       568.89
      45.023     0.998437        13999       640.00
      45.023     0.998633        13999       731.43
      45.023     0.998828        13999       853.33
      45.023     0.999023        13999      1024.00
      45.023     0.999121        13999      1137.78
      45.023     0.999219        13999      1280.00
      45.023     0.999316        13999      1462.86
      45.023     0.999414        13999      1706.67
      45.023     0.999512        13999      2048.00
      45.023     0.999561        13999      2275.56
      45.023     0.999609        13999      2560.00
      45.023     0.999658        13999      2925.71
      45.023     0.999707        13999      3413.33
      45.023     0.999756        13999      4096.00
      45.023     0.999780        13999      4551.11
      45.023     0.999805        13999      5120.00
      45.023     0.999829        13999      5851.43
      45.023     0.999854        13999      6826.67
      45.023     0.999878        13999      8192.00
      45.023     0.999890        13999      9102.22
      45.023     0.999902        13999     10240.00
      45.023     0.999915        13999     11702.86
      45.023     0.999927        13999     13653.33
      45.215     0.999939        14000     16384.00
      45.215     1.000000        14000          inf
#[Mean    =        7.450, StdDeviation   =       13.413]
#[Max     =       45.184, Total count    =        14000]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  244.00us
 75.000%  282.00us
 90.000%   40.70ms
 99.000%   43.97ms
 99.900%   44.03ms
 99.990%   44.80ms
 99.999%   44.96ms
100.000%   44.96ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.120     0.000000            5         1.00
       0.162     0.100000         1404         1.11
       0.182     0.200000         2813         1.25
       0.197     0.300000         4252         1.43
       0.220     0.400000         5608         1.67
       0.244     0.500000         7046         2.00
       0.253     0.550000         7774         2.22
       0.261     0.600000         8454         2.50
       0.268     0.650000         9136         2.86
       0.275     0.700000         9802         3.33
       0.282     0.750000        10501         4.00
       0.287     0.775000        10905         4.44
       0.291     0.800000        11223         5.00
       0.296     0.825000        11556         5.71
       0.303     0.850000        11938         6.67
       0.311     0.875000        12261         8.00
       0.319     0.887500        12430         8.89
      40.703     0.900000        12607        10.00
      40.831     0.912500        12857        11.43
      40.863     0.925000        12997        13.33
      40.895     0.937500        13138        16.00
      40.927     0.943750        13275        17.78
      40.959     0.950000        13411        20.00
      40.959     0.956250        13411        22.86
      40.991     0.962500        13476        26.67
      43.871     0.968750        13567        32.00
      43.903     0.971875        13628        35.56
      43.935     0.975000        13768        40.00
      43.935     0.978125        13768        45.71
      43.935     0.981250        13768        53.33
      43.967     0.984375        13881        64.00
      43.967     0.985938        13881        71.11
      43.967     0.987500        13881        80.00
      43.967     0.989062        13881        91.43
      43.967     0.990625        13881       106.67
      43.999     0.992188        13972       128.00
      43.999     0.992969        13972       142.22
      43.999     0.993750        13972       160.00
      43.999     0.994531        13972       182.86
      43.999     0.995313        13972       213.33
      43.999     0.996094        13972       256.00
      43.999     0.996484        13972       284.44
      43.999     0.996875        13972       320.00
      43.999     0.997266        13972       365.71
      43.999     0.997656        13972       426.67
      44.031     0.998047        13996       512.00
      44.031     0.998242        13996       568.89
      44.031     0.998437        13996       640.00
      44.031     0.998633        13996       731.43
      44.031     0.998828        13996       853.33
      44.031     0.999023        13996      1024.00
      44.031     0.999121        13996      1137.78
      44.031     0.999219        13996      1280.00
      44.031     0.999316        13996      1462.86
      44.031     0.999414        13996      1706.67
      44.031     0.999512        13996      2048.00
      44.031     0.999561        13996      2275.56
      44.031     0.999609        13996      2560.00
      44.031     0.999658        13996      2925.71
      44.031     0.999707        13996      3413.33
      44.063     0.999756        13997      4096.00
      44.063     0.999780        13997      4551.11
      44.767     0.999805        13998      5120.00
      44.767     0.999829        13998      5851.43
      44.767     0.999854        13998      6826.67
      44.799     0.999878        13999      8192.00
      44.799     0.999890        13999      9102.22
      44.799     0.999902        13999     10240.00
      44.799     0.999915        13999     11702.86
      44.799     0.999927        13999     13653.33
      44.959     0.999939        14000     16384.00
      44.959     1.000000        14000          inf
#[Mean    =        4.420, StdDeviation   =       12.546]
#[Max     =       44.928, Total count    =        14000]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  15002 requests in 2.50m, 2.33MB read
Requests/sec:    100.01
Transfer/sec:     15.92KB